Repository: zikula-modules/Files
Catalog: locale/*/LC_MESSAGES/module_files.po
Languages: ca

source: The server directory does not exist.
ca: El directori servidor no existeix.

source: Invalid folder
ca: Directori incorrecte

source: It is not possible to browse this folder
ca: No ha estat possible seleccionar aquesta carpeta

source: More than 200 Mb
ca: Més de 200 Mb

source: Unzip file
ca: Descomprimeix el fitxer

source: List of the file content
ca: Continguts del fitxer

source: Download file
ca: Descarrega l'arxiu

source: Edit file
ca: Edita el fitxer

source: Create Thumbnail
ca: Crea una nova miniatura

source: Rename file
ca: Canvia el nom

source: Error! You are not authorized to access this module.
ca: Error! No esteu atoritzats a accedir a aquest mòdul

source: File not found
ca: Fitxer no trobat

source: It is not possible to create a thumbnail from this file.
ca: No ha estat possible crear una miniatura d'aquest fitxer

source: Error! It has been possible to read the file.
ca: Error! No ha estat possible llegir aquest fitxer

source: Error! Saving the image in memory.
ca: Error! Guardant la imatge en memòria

source: Error! Creating the thumbnail of the image.
ca: Error! Creant la miniatura de la imatge

source: Thumbnail created.
ca: S'ha creat la miniatura

source: Sorry! The file %s is not editable.
ca: Perdoneu! No és possible editar el fitxer %s.

source: Sorry! The file %s has not been found.
ca: Perdoneu! No s'ha trobat el fitxer %s.

source: Error! It has not been possible to read the content of the file %s.
ca: Error! No ha estat possible llegir el contingut del fitxer %s.

source: Error! It has not been possible to write the content to the file %s.
ca: Error! No ha estat possible escriure en el fitxer %s.

source: File successfully edited
ca: Fitxer editat correctament

source: You can not delete the users folder!
ca: No té permís per eliminar aquesta carpeta!

source: Failed to deleted
ca: No s'ha pogut esborrar el fitxer

source: Error deleting file
ca: S'ha produït un error al eliminar el fitxer

source: Files successfully removed
ca: Fitxer eliminat correctament

source: The extension <strong>%s</strong> is not allowed. The allowed extensions are: <strong>%s</strong>.
ca: L'extensió <strong>%s</strong> no està permesa. Les extensions permeses són: <strong>%s</strong>.

source: Failed to rename
ca: El canvi de nom a fallat

source: Changed filename successfully
ca: S'ha canviat el nom del fitxer

source: Directory Create Error
ca: Error en la creació del directori

source: Directory created
ca: S'ha creat el directori

source: The directory "%s" does not exist.
ca: El directori "%s" no existeix

source: The extension <strong>%s</strong> is not allowed. The allowed extensions are: <strong>%s</strong>.
ca: L'extensió <strong>%s</strong> no està permesa. Les extensions permeses són: <strong>%s</strong>.

source: The file is to big. The maximum size allowed is "%s" bytes.
ca: El fitxer és massa gran. La mida màxima permesa és de "%s" bytes.

source: You have not enough disk space to upload the file.
ca: No disposa de suficient espai en el disc per carregar el fitxer

source: Failed to upload
ca: No s'ha pogut pujar el fitxer

source: Uploaded file success
ca: El fitxer s'ha pujat correctament al servidor

source: No selected action
ca: No ha seleccionat cap acció a realitzar

source: No selected file or directory
ca: No ha seleccionat cap fitxer o directori

source: No file name given
ca: No has donat el nom del fitxer

source: Error creating ZIP file
ca: S'ha produït un error al crear el fitxer ZIP

source: Successfully zipped
ca: La compressió ha tingut èxit

source: Failed to list content zip file.
ca: No s'ha pogut llistar el contingut de l'arxiu zip.

source: Error moving
ca: S'ha produït un error al moure

source: Successfully moved
ca: S'ha mogut amb èxit!

source: The zip file contains at least one file with the extension <strong>%s</strong> which is not allowed. The allowed extensions are: <strong>%s</strong>.
ca: El fitxer zip conté com a mínim un fitxer amb l'extensió <strong>%s</strong>, la qual no està permesa. Les extensions permeses són: <strong>%s<strong>.

source: You have not enough disk space to unzip the file. You need %s extra bytes.
ca: No disosa de suficient espai de disc per carregar el fitxer. Necessita %s bytes adicionals

source: Failed to unzip
ca: La descompresió ha fallat

source: Successfully unzipped
ca: Descompressió amb èxit

source: Directory creation error. Please contact with the administrator
ca: Error en la creació del directori. Si us plau contecteu amb l'administrador

source: Directory creation error
ca: S'ha produït un error en la creació del directori

source: The "%s" directory does not exist or is not writable.
ca: El directori "%s" no existeix o bé no té permisos d'escriptura

source: Manage Files
ca: Gestiona els fitxers

source: Module configuration
ca: Configuració del mòdul

source: File Manager
ca: Gestor de fitxers

source: The directory <strong>%s</strong> does not exist
ca: El directori <strong>%s</strong> no existeix

source: The directory <strong>%s</strong> for users does not exist
ca: El directori <strong>%s</strong>, destinat a usuaris, no existeix

source: The configuration has been updated
ca: La conficuració s'ha actualitzat correctament

source: File manager for Zikula sites.
ca: Gestió de fitxers per a llocs Zikula

source: files
ca: fitxers

source: No folder defined.
ca: No s'ha especificat el directori

source: no group found
ca: no s'ha trobat el grup

source: no quota defined
ca: no s'ha especificat la quota

source: no image found
ca: no s'ha trobat la imatge

source: no size factor defined
ca: no s'ha especificat el factor de redimensionament

source: Sorry! You have not been granted access to this page.
ca: Perdoneu! No se us ha concedit el permís per accedir a aquesta pàgina

source: The server directory does not exist. Contact with the website administrator to solve this problem.
ca: El directori servidor no existeix. Contacti amb l'administrador del lloc web per tal de resoldre el problema

source: Error! Could not load items.
ca: S'ha produït un error en carregar elements

source: Error! Could not create the new item.
ca: Error! No és possible crear el nou element

source: Error! Could not update the used disk.
ca: Error! No és possible actualitzar l'espai de disc ocupat

source: Sorry! No authorization to access this module.
ca: No teniu autorització per accedir a aquest mòdul

source: Choose a group...
ca: Escull un grup...

source: Save the changes
ca: Desa els canvis

source: -1 means no disk quota limit
ca: -1 indica quota de disc il·limitada

source: Reduce size
ca: Redueix la mida

source: Increase size
ca: Augmenta la mida

source: Delete thumbnail
ca: Elimina la miniatura

source: Create folder
ca: Crea una carpeta

source: Folder name
ca: Nom de la carpeta

source: Accept
ca: Accepta

source: Cancel
ca: Cancel·la

source: List of files in folder
ca: Llista de fitxers en el directori

source: It is not possible to write in this directory. Make it writable.
ca: No ha estat possible escriure al directori. Habiliti els permissos d'escriptura

source: Create directory
ca: Crea un dirctori

source: Upload file
ca: Puja un fitxer

source: Set as not public folder
ca: Fes que no sigui un directori públic

source: Set as a public folder
ca: Estableix com a directori públic

source: Disk use:
ca: Ús del disc;

source: The files in this directory are accessible directly from the navigator. Anybody can access to them with the URL:
ca: Els documents d'aquest directori són accessibles des de la finestra del navegador. S'hi pot accedir amb la URL:

source: file_name
ca: Nom_del_fitxer

source: Name
ca: Nom

source: Size
ca: Mida

source: Modified
ca: Modificat

source: Action
ca: Acció

source: Rename folder
ca: Reanomena la carpeta

source: Delete folder
ca: Elimina la carpeta

source: -- Selected files --
ca: -- Fitxers seleccionats --

source: Move them to another folder
ca: Mou-los a un altre directori

source: Delete them
ca: Esborra'ls

source: Create a zip file with them
ca: Crear un fitxer zip

source: Drag and drop the images to the HTML editor
ca: Arrossega i deixa anar les imatges en l'editor HTML

source: The values displayed in each image are its real size "width x height" and the factor of the modification of its size (value). The value 1 means that the image is in its natural size. A value upper than 1 means that the image has been reduced and a value lower than 1 means that the image has been increased.
ca: Es mostra la mida real de la imatge "amplada x alçada" i el factor de redimensionament. El valor 1 significa que la imatge es troba en el seva mida original. Amb un valor superior a 1 la imatge es reduirà i amb un valor inferior a 1 la imatge s'ampliarà.

source: Group
ca: Grup

source: Delete
ca: Esborrament

source: Delete disk quota
ca: Elimina la quota de disc

source: Assign a new disk quota
ca: Asigna una nova quota de disc

source: (A value of -1 means no disk quota assigned)
ca: (El valor -1 significa que no s'ha assignat quota de disc)

source: Moving
ca: Movent

source: Move to
ca: Moure a

source: Files
ca: Fitxers

source: File name
ca: Nom del fitxer

source: User's files
ca: Fitxers de l'usuari

source: New filename
ca: Nou nom de fitxer

source: The list of the archive content
ca: Continguts de l'arxiu

source: Create zip file
ca: Crea un fitxer zip

source: Generates a zip with this content
ca: Genera un fitxer zip amb els següents continguts

source: Filename
ca: Nom d'arxiu

source: Delete File
ca: Elimina el Fitxer

source: Confirm deletion of:
ca: Confirma l'eliminació de;

source: Confirmation prompt
ca: Sol·licitud de confirmació

source: Modify configuration
ca: Modifica la configuració

source: You should move the file file.php from modules/Files to the zikula root directory
ca: Mogui el fitxer fitxer.php de moduls/Fitxers al directori arrel de Zikula

source: You should remove the file file.php from modules/Files
ca: Elimini el fitxer fitxer.php de moduls/Fitxers

source: Settings
ca: Modifica la configuració

source: Files system physical path
ca: Ruta al sistema de fitxers físic

source: The folder does not exist or it is not writable
ca: La carpeta no existeix o no s'hi pot escriure

source: Users' folder
ca: Carpeta d'usuaris

source: Show hidden files
ca: Mostra els fitxers ocults

source: Do not show to anyone
ca: No mostra a ningú

source: Only show to administrators
ca: Mostra només a administradors

source: Show to everyone
ca: Mostra a tothom

source: Allowed extensions (comma separated list)
ca: Extensions permeses (separades per comes)

source: Editable extensions (comma separated list)
ca: Extensions editables (separades per comes)

source: Maximum file size
ca: Mida màxima del fitxer

source: Default width for images in editor
ca: Amplada per defecte per a les imatges a l'editor

source: Default height for images in editor
ca: Alçada per defecte per a les imatges a l'editor

source: Default disk quota
ca: Quota de disc per defecte

source: Disk quotas for groups
ca: Quota de disc per a grups

source: Files module installation
ca: Instal·lació dels fitxers del mòdul

source: Welcome to Files module
ca: Benvingut al mòdul Fitxers

source: This module allow user to manage their own files.<br />Each user has a folder for his/her files.<br />This module needs two writable folders that have to be created.
ca: Aquest mòdul permet a l'usuari gestionar els seus fitxers.<br />Cada usuari disposa d'una capreta amb els seus fitxers.<br />Aquest mòdul necessita que es creïn dos directoris amb permissos d'escriptura

source: Proceed with the installation
ca: Continua amb l'instal·lació

source: Check if the files folders in the server have been created and define them using the form below.<br />These folders will be used to save the files of the site and the users' files.<br />We recommend to locate them out of the public HTTP.
ca: Comprovi que els directoris per a fitxers han estat creats i especifiqui les seves característiques en el següent formulari. Aquests directoris s'utilitzaran per guardar els fitxers del lloc i dels usuaris.<br />Es recomana allotjar-los fora de l'espai públic HTTP.

source: Defining the files folders
ca: Definint les carpetes per a fitxers

source: Write the physical location of the folder in the server
ca: Escriu la localització física de la carpeta en el servidor

source: Write the users' folder name
ca: Escriu el nom de la carpeta d'usuari

source: Checking if the files folders exist and they are writable
ca: Comprovant si els directoris per a fitxers existeixen i tenen permissos d'escriptura

source: The folder <strong>%s</strong> has not been found.
ca: No s'ha trobat el directori <strong>%s</strong>

source: The folder <strong>%s</strong> is not writable and it should be.
ca: El directori <strong>%s</strong> no té permisos d'escriptura i hauria de tenir-ne

source: The folder <strong>%s</strong> is writable.
ca: El directori <strong>%s</strong> té permissos d'escriptura

source: The folder <strong>%s/%s</strong> has not been found.
ca: No s'ha trobat el directori <strong>%s/%s</strong>

source: The folder <strong>%s/%s</strong> is located in the correct place.
ca: La localització del directori <strong>%s/%s</strong> es correcte

source: The folder <strong>%s</strong> is located in the correct place.
ca: La localització del directori <strong>%s</strong> es correcte

source: The folder <strong>%s/%s</strong> is not writable and it should be.
ca: El directori <strong>%s/%s</strong> no té permisos d'escriptura i hauria de tenir-ne

source: The folder <strong>%s/%s</strong> is writable.
ca: El directori <strong>%s/%s</strong> té permissos d'escriptura

source: Define folders again. Remember that you have to create the folders after define them.
ca: Especifiqui els directoris altra vegada. Recordi que s'han de crear del directoris dessorés de definir-los.

source: Make the folders writable and try again.
ca: Doni permissos d'escriptura a les carpetes i torni-ho a provar

source: Proceed with the module installation
ca: Continua amb la instal·lació del mòdul

source: Close window
ca: Tanca la finestra
